import json

forbiddencounterpart = ['11.1', '11.2', '11.3', '11.4', '11.5']
forbiddenMovePurposes = ['1.5', '2.1', '2.2', '2.3', '7.1', '8.1', '11.2']
forbiddenMeasurement = ['2.1', '2.2', '2.3', '7.1', '8.1', '8.2', '11.2']
class Helper:
    def MovePurpose(self):
        data = {
            1: "Πώληση",
            2: "Πώληση για Λογαριασμό Τρίτων",
            3: "Δειγματισμός",
            4: "Έκθεση",
            5: "Επιστροφή",
            6: "Φύλαξη",
            7: "Επεξεργασία Συναρμολόγηση",
            8: "Μεταξύ Εγκαταστάσεων Οντότητας",
            9: "Αγορά",
            10: "Εφοδιασμός πλοίων και αεροσκαφών",
            11: "Δωρεάν διάθεση",
            12: "Εγγύηση",
            13: "Χρησιδανεισμός",
            14: "Αποθήκευση σε Τρίτους",
            15: "Επιστροφή από Φύλαξη",
            16: "Ανακύκλωση",
            17: "Καταστροφή άχρηστου υλικού",
            18: "Διακίνηση Παγίων (Ενδοδιακίνηση)",
            19: "Λοιπές Διακινήσεις"
        }
        return data

    def IncomeclassificationCategory(self):
        data = {
            "category1_1": "Έσοδα από Πώληση Εμπορευμάτων",
            "category1_2": "Έσοδα από Πώληση Προϊόντων",
            "category1_3": "Έσοδα από Παροχή Υπηρεσιών",
            "category1_4": "Έσοδα από Πώληση Παγίων",
            "category1_5": "Λοιπά Έσοδα/ Κέρδη",
            "category1_6": "Αυτοπαραδόσεις / Ιδιοχρησιμοποιήσεις",
            "category1_7": "Έσοδα για λ/σμο τρίτων",
            "category1_8": "Έσοδα προηγούμενων χρήσεων",
            "category1_9": "Έσοδα επομένων χρήσεων",
            "category1_10": "Λοιπές Εγγραφές Τακτοποίησης Εσόδων",
            "category1_95": "Λοιπά Πληροφοριακά Στοιχεία Εσόδων",
            "category3": "Διακίνηση"
        }
        return data

    def ExpenseclassificationCategory(self):  # Χαρακτηρισμού Εξόδων
        data = {
            "category2_1": "Αγορές Εμπορευμάτων",
            "category2_2": "Αγορές Α'-Β' Υλών",
            "category2_3": "Λήψη Υπηρεσιών",
            "category2_4": "Γενικά Έξοδα με δικαίωμα έκπτωσης ΦΠΑ",
            "category2_5": "Γενικά Έξοδα χωρίς δικαίωμα έκπτωσης ΦΠΑ",
            "category2_6": "Αμοιβές και Παροχές προσωπικού",
            "category2_7": "Αγορές Παγίων",
            "category2_8": "Αποσβέσεις Παγίων",
            "category2_9": "Έξοδα για λ/σμο τρίτων",
            "category2_10": "Έξοδα προηγούμενων χρήσεων",
            "category2_11": "Έξοδα επομένων χρήσεων",
            "category2_12": "Λοιπές Εγγραφές Τακτοποίησης Εξόδων",
            "category2_13": "Αποθέματα Έναρξης Περιόδου",
            "category2_14": "Αποθέματα Λήξης Περιόδου",
            "category2_95": "Λοιπά Πληροφοριακά Στοιχεία Εξόδων"
        }
        return data

    def invoiceType(self):
        data = {
            1.1: ["Τιμολόγιο Πώλησης", "Τιμολόγιο Πώλησης"],
            1.2: ["Τιμολόγιο Πώλησης / Ενδοκοινοτικές Παραδόσεις", "Τιμολόγιο Πώλησης"],
            1.3: ["Τιμολόγιο Πώλησης / Παραδόσεις Τρίτων Χωρών", "Τιμολόγιο Πώλησης"],
            1.4: ["Τιμολόγιο Πώλησης / Πώληση για Λογαριασμό Τρίτων", "Τιμολόγιο Πώλησης"],
            1.5: ["Τιμολόγιο Πώλησης / Εκκαθάριση Πωλήσεων Τρίτων - Αμοιβή από Πωλήσεις Τρίτων", "Τιμολόγιο Πώλησης"],
            1.6: ["Τιμολόγιο Πώλησης / Συμπληρωματικό Παραστατικό", "Τιμολόγιο Πώλησης"],
            2.1: ["Τιμολόγιο Παροχής", "Τιμολόγιο Παροχής Υπηρεσιών"],
            2.2: ["Τιμολόγιο Παροχής / Ενδοκοινοτική Παροχή Υπηρεσιών", "Τιμολόγιο Παροχής Υπηρεσιών"],
            2.3: ["Τιμολόγιο Παροχής / Παροχή Υπηρεσιών σε λήπτη Τρίτης Χώρας", "Τιμολόγιο Παροχής Υπηρεσιών"],
            2.4: ["Τιμολόγιο Παροχής / Συμπληρωματικό Παραστατικό", "Τιμολόγιο Παροχής Υπηρεσιών"],
            3.1: ["Τίτλος Κτήσης (μη υπόχρεος Εκδότης)", "Τίτλος Κτήσης"],
            3.2: ["Τίτλος Κτήσης (άρνηση έκδοσης από υπόχρεο Εκδότη)", "Τίτλος Κτήσης"],
            5.1: ["Πιστωτικό Τιμολόγιο / Συσχετιζόμενο", "Πιστωτικό Τιμολόγιο"],
            5.2: ["Πιστωτικό Τιμολόγιο / Μη Συσχετιζόμενο", "Πιστωτικό Τιμολόγιο"],
            6.1: ["Στοιχείο Αυτοπαράδοσης", "Στοιχείο Αυτοπαράδοσης - Ιδιοχρησιμοποίησης"],
            6.2: ["Στοιχείο Ιδιοχρησιμοποίησης", "Στοιχείο Αυτοπαράδοσης - Ιδιοχρησιμοποίησης"],
            7.1: ["Συμβόλαιο - Έσοδο", "Συμβόλαιο - Έσοδο"],
            8.1: ["Ενοίκια - Έσοδο", "Ειδικό Στοιχείο (Έσοδο) – Απόδειξη Είσπραξης"],
            8.2: ["Ειδικό Στοιχείο – Απόδειξης Είσπραξης Φόρου Διαμονής",
                  "Ειδικό Στοιχείο (Έσοδο) – Απόδειξη Είσπραξης"],
            8.4: ["Απόδειξη Είσπραξης POS", "Ειδικό Στοιχείο (Έσοδο) – Απόδειξη Είσπραξης"],
            8.5: ["Απόδειξη Επιστροφής POS", "Ειδικό Στοιχείο (Έσοδο) – Απόδειξη Είσπραξης"],
            8.6: ["Δελτίο Παραγγελίας Εστίασης", "Δελτίο Παραγγελίας"],
            9.3: ["Δελτίο Αποστολής", "Παραστατικό Διακίνησης"],
            11.1: ["ΑΛΠ", "Παραστατικά Λιανικής"],
            11.2: ["ΑΠΥ", "Παραστατικά Λιανικής"],
            11.3: ["Απλοποιημένο Τιμολόγιο", "Παραστατικά Λιανικής"],
            11.4: ["Πιστωτικό Στοιχ. Λιανικής", "Παραστατικά Λιανικής"],
            11.5: ["Απόδειξη Λιανικής Πώλησης για Λογ/σμό Τρίτων", "Παραστατικά Λιανικής"],
            13.1: ["Έξοδα - Αγορές Λιανικών Συναλλαγών ημεδαπής / αλλοδαπής", "Λήψη Παραστατικών Λιανικής"],
            13.2: ["Παροχή Λιανικών Συναλλαγών ημεδαπής / αλλοδαπής", "Λήψη Παραστατικών Λιανικής"],
            13.3: ["Κοινόχρηστα", "Λήψη Παραστατικών Λιανικής"],
            13.4: ["Συνδρομές", "Λήψη Παραστατικών Λιανικής"],
            13.30: ["Παραστατικά Οντότητας ως Αναγράφονται από την ίδια (Δυναμικό)", "Λήψη Παραστατικών Λιανικής"],
            13.31: ["Πιστωτικό Στοιχ. Λιανικής ημεδαπής / αλλοδαπής", "Λήψη Παραστατικών Λιανικής"],
            14.1: ["Τιμολόγιο / Ενδοκοινοτικές Αποκτήσεις", "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            14.2: ["Τιμολόγιο / Αποκτήσεις Τρίτων Χωρών", "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            14.3: ["Τιμολόγιο / Ενδοκοινοτική Λήψη Υπηρεσιών", "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            14.4: ["Τιμολόγιο / Λήψη Υπηρεσιών Τρίτων Χωρών", "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            14.5: ["ΕΦΚΑ και λοιποί Ασφαλιστικοί Οργανισμοί", "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            14.30: ["Παραστατικά Οντότητας ως Αναγράφονται από την ίδια (Δυναμικό)",
                    "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            14.31: ["Πιστωτικό ημεδαπής / αλλοδαπής", "Παραστ. Εξαιρ. Οντοτήτων ημεδαπής / αλλοδαπής"],
            15.1: ["Συμβόλαιο - Έξοδο", "Συμβόλαιο - Έξοδο"],
            16.1: ["Ενοίκιο Έξοδο", "Ειδικό Στοιχείο (Έξοδο) – Απόδειξη Πληρωμής"],
            17.1: ["Μισθοδοσία", "Εγγραφές Οντότητας"],
            17.2: ["Αποσβέσεις", "Εγγραφές Οντότητας"],
            17.3: ["Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Λογιστική Βάση", "Εγγραφές Οντότητας"],
            17.4: ["Λοιπές Εγγραφές Τακτοποίησης Εσόδων - Φορολογική Βάση", "Εγγραφές Οντότητας"],
            17.5: ["Λοιπές Εγγραφές Τακτοποίησης Εξόδων - Λογιστική Βάση", "Εγγραφές Οντότητας"],
            17.6: ["Λοιπές Εγγραφές Τακτοποίησης Εξόδων - Φορολογική Βάση", "Εγγραφές Οντότητας"]
        }

        return data

    def vatExemptionCategories(self):
        data = {
            1: "Χωρίς ΦΠΑ – άρθρο 2 και 3 του Κώδικα ΦΠΑ",
            2: "Χωρίς ΦΠΑ - άρθρο 5 του Κώδικα ΦΠΑ",
            3: "Χωρίς ΦΠΑ - άρθρο 13 του Κώδικα ΦΠΑ",
            4: "Χωρίς ΦΠΑ - άρθρο 14 του Κώδικα ΦΠΑ",
            5: "Χωρίς ΦΠΑ - άρθρο 16 του Κώδικα ΦΠΑ",
            6: "Χωρίς ΦΠΑ - άρθρο 19 του Κώδικα ΦΠΑ",
            7: "Χωρίς ΦΠΑ - άρθρο 22 του Κώδικα ΦΠΑ",
            8: "Χωρίς ΦΠΑ - άρθρο 24 του Κώδικα ΦΠΑ",
            9: "Χωρίς ΦΠΑ - άρθρο 25 του Κώδικα ΦΠΑ",
            10: "Χωρίς ΦΠΑ - άρθρο 26 του Κώδικα ΦΠΑ",
            11: "Χωρίς ΦΠΑ - άρθρο 27 του Κώδικα ΦΠΑ",
            12: "Χωρίς ΦΠΑ - άρθρο 27 - Πλοία Ανοικτής Θαλάσσης του Κώδικα ΦΠΑ",
            13: "Χωρίς ΦΠΑ - άρθρο 27.1.γ - Πλοία Ανοικτής Θαλάσσης του Κώδικα ΦΠΑ",
            14: "Χωρίς ΦΠΑ - άρθρο 28 του Κώδικα ΦΠΑ",
            15: "Χωρίς ΦΠΑ - άρθρο 39 του Κώδικα ΦΠΑ",
            16: "Χωρίς ΦΠΑ - άρθρο 39α του Κώδικα ΦΠΑ",
            17: "Χωρίς ΦΠΑ - άρθρο 40 του Κώδικα ΦΠΑ",
            18: "Χωρίς ΦΠΑ - άρθρο 41 του Κώδικα ΦΠΑ",
            19: "Χωρίς ΦΠΑ - άρθρο 47 του Κώδικα ΦΠΑ",
            20: "ΦΠΑ εμπεριεχόμενος - άρθρο 43 του Κώδικα ΦΠΑ",
            21: "ΦΠΑ εμπεριεχόμενος - άρθρο 44 του Κώδικα ΦΠΑ",
            22: "ΦΠΑ εμπεριεχόμενος - άρθρο 45 του Κώδικα ΦΠΑ",
            23: "ΦΠΑ εμπεριεχόμενος - άρθρο 46 του Κώδικα ΦΠΑ",
            24: "Χωρίς ΦΠΑ - άρθρο 6 του Κώδικα ΦΠΑ",
            25: "Χωρίς ΦΠΑ - ΠΟΛ.1029/1995",
            26: "Χωρίς ΦΠΑ - ΠΟΛ.1167/2015",
            27: "Λοιπές Εξαιρέσεις ΦΠΑ",
            28: "Χωρίς ΦΠΑ – άρθρο 24 περ. β' παρ.1 του Κώδικα ΦΠΑ, (Tax Free)",
            29: "Χωρίς ΦΠΑ – άρθρο 47β, του Κώδικα ΦΠΑ (OSS μη ενωσιακό καθεστώς)",
            30: "Χωρίς ΦΠΑ – άρθρο 47γ, του Κώδικα ΦΠΑ (OSS ενωσιακό καθεστώς)",
            31: "Χωρίς ΦΠΑ – άρθρο 47δ του Κώδικα ΦΠΑ (IOSS)"
        }
        return data

    def PaymentTypes(self):
        data = {
            1: "Επαγ. Λογαριασμός Πληρωμών Ημεδαπής",
            2: "Επαγ. Λογαριασμός Πληρωμών Αλλοδαπής",
            3: "Μετρητά",
            4: "Επιταγή",
            5: "Επί Πιστώσει",
            6: "Web Banking",
            7: "POS / e-POS"
            }
        return data

    def TaxTypes(self):
        data = {
            1: "Παρακρατούμενος Φόρος",
            2: "Τέλη",
            3: "Λοιποί Φόροι",
            4: "Χαρτόσημο",
            5: "Κρατήσεις"
        }
        return data

    # "1": "Παρακρατούμενος Φόρος"
    def withheld(self):
        data = {
            1: ["Περιπτ. β’- Τόκοι", 0.15],
            2: ["Περιπτ. γ’ - Δικαιώματα", 0.20],
            3: ["Περιπτ. δ’ - Αμοιβές Συμβουλών Διοίκησης", 0.20],
            4: ["Περιπτ. δ’ - Τεχνικά Έργα", 0.03],
            5: ["Υγρά καύσιμα και προϊόντα καπνοβιομηχανίας", 0.01],
            6: ["Λοιπά Αγαθά", 0.04],
            7: ["Παροχή Υπηρεσιών", 0.08],
            8: [
                "Προκαταβλητέος Φόρος Αρχιτεκτόνων και Μηχανικών επί Συμβατικών Αμοιβών, για Εκπόνηση Μελετών και Σχεδίων",
                0.04],
            9: [
                "Προκαταβλητέος Φόρος Αρχιτεκτόνων και Μηχανικών επί Συμβατικών Αμοιβών, που αφορούν οποιασδήποτε άλλης φύσης έργα",
                0.10],
            10: ["Προκαταβλητέος Φόρος στις Αμοιβές Δικηγόρων 15%", 0.15],
            11: ["Παρακράτηση Φόρου Μισθωτών Υπηρεσιών παρ. 1 αρ. 15 ν. 4172/2013", 'ποσό'],
            12: ["Παρακράτηση Φόρου Μισθωτών Υπηρεσιών παρ. 2 αρ. 15 ν. 4172/2013 - Αξιωματικών Εμπορικού Ναυτικού",
                   0.15],
            13: [
                "Παρακράτηση Φόρου Μισθωτών Υπηρεσιών παρ. 2 αρ. 15 ν. 4172/2013 - Κατώτερο Πλήρωμα Εμπορικού Ναυτικού",
                0.10],
            14: ["Παρακράτηση Ειδικής Εισφοράς Αλληλεγγύης", 'ποσό'],
            15: ["Παρακράτηση Φόρου Αποζημίωσης λόγω Διακοπής Σχέσης Εργασίας παρ. 3 αρ. 15 ν. 4172/2013", 'ποσό'],
            16: ["Παρακρατήσεις συναλλαγών αλλοδαπής βάσει συμβάσεων αποφυγής διπλής φορολογίας (Σ.Α.Δ.Φ.)", 'ποσό'],
            17: ["Λοιπές Παρακρατήσεις Φόρου", 'ποσό'],
            18: ["Παρακράτηση Φόρου Μερίσματα περ.α παρ. 1 αρ. 64 ν. 4172/2013", 0.05]
        }
        return data

    # "2": "Τέλη",
    def Fees(self):
        data = {
            1: ["Για μηνιαίο λογαριασμό μέχρι και 50 ευρώ", 0.12],
            2: ["Για μηνιαίο λογαριασμό από 50,01 μέχρι και 100 ευρώ", 0.15],
            3: ["Για μηνιαίο λογαριασμό από 100,01 μέχρι και 150 ευρώ", 0.18],
            4: ["Για μηνιαίο λογαριασμό από 150,01 ευρώ και άνω", 0.20],
            5: ["Τέλος καρτοκινητής επί της αξίας του χρόνου ομιλίας", 0.12],
            6: ["Τέλος στη συνδρομητική τηλεόραση", 0.10],
            7: ["Τέλος συνδρομητών σταθερής τηλεφωνίας", 0.05],
            8: ["Περιβαλλοντικό Τέλος & πλαστικής σακούλας", 'ποσό'],
            9: ["Εισφορά δακοκτονίας", 0.02],
            10: ["Λοιπά τέλη", 'ποσό'],
            11: ["Τέλη Λοιπών Φόρων", 'ποσό'],
            12: ["Εισφορά δακοκτονίας", 'ποσό'],
            13 : ["Για μηνιαίο λογαριασμό κάθε σύνδεσης", 0.10],
            14: ["Τέλος καρτοκινητής επί της αξίας του χρόνου ομιλίας", 0.10],
            15: ["Τέλος κινητής και καρτοκινητής για φυσικά πρόσωπα ηλικίας 15 έως και 29 ετών", 0],
            16: ["Εισφορά προστασίας περιβάλλοντος πλαστικών προϊόντων", 'ποσό'],
            17: ["Τέλος ανακύκλωσης", 'ποσό'],
            18: ["Τέλος διαμονής παρεπιδημούντων", 'ποσό'],
            19: ["Τέλος επί των ακαθάριστων εσόδων των εστιατορίων και συναφών καταστημάτων", 'ποσό'],
            20: ["Τέλος επί των ακαθάριστων εσόδων των κέντρων διασκέδασης", 'ποσό'],
            21: ["Τέλος επί των ακαθάριστων εσόδων των καζίνο", 'ποσό'],
            22: ["Λοιπά τέλη επί των ακαθάριστων εσόδων", 'ποσό']
        }
        return data

    # "3": "Λοιποί Φόροι",
    def otherTaxes(self):
        data = {
            1: ["ασφάλιστρα κλάδου πυρός 20%", 0.20],
            2: ["ασφάλιστρα κλάδου πυρός 5%", 0.05],
            3: ["ασφάλιστρα κλάδου ζωής 4%", 0.04],
            4: ["ασφάλιστρα λοιπών κλάδων 15%", 0.15],
            5: ["απαλλασσόμενα φόρου ασφαλίστρων 0%", 0],
            6: ["Ξενοδοχεία 1-2 αστέρων 0,50", 'ποσό'],
            7: ["Ξενοδοχεία 3 αστέρων 1,50", 'ποσό'],
            8: ["Ξενοδοχεία 4 αστέρων 3,00", 'ποσό'],
            9: ["Ξενοδοχεία 4 αστέρων 4,00", 'ποσό'],
            10: ["Ενοικιαζόμενα - επιπλωμένα δωμάτια - διαμερίσματα", 'ποσό'],
            11: ["Ειδικός Φόρος στις διαφημίσεις που προβάλλονται από την τηλεόραση (ΕΦΤΔ)", 0.05],
            12: ["αποκτούμενα και εισαγόμενα από τρίτες χώρες 10%", 0.10],
            13: ["για τα εγχωρίως παραγόμενα είδη 10%", 0.10],
            14: ["Δικαίωμα του Δημοσίου στα εισιτήρια των καζίνο", 0.80],
            15: ["ασφάλιστρα κλάδου πυρός 20%", 0.20],
            16: ["Λοιποί Τελωνειακοί Δασμοί-Φόροι", 'ποσό'],
            17: ["Λοιποί Φόροι", 'ποσό'],
            18: ["Επιβαρύνσεις Λοιπών Φόρων", 'ποσό'],
            19: ["ΕΦΚ", 'ποσό']
        }
        return data

    # "4": "Χαρτόσημο",
    def stampDuty(self):
        data = {
            1: ["Συντελεστής 1,2 %", 0.012],
            2: ["Συντελεστής 2,4 %", 0.024],
            3: ["Συντελεστής 3,6 %", 0.036],
            4: ["Λοιπές περιπτώσεις", 'ποσό']
        }
        return data

    def vatCategories(self):
        data = {
            1: ["ΦΠΑ συντελεστής 24%", 0.24],
            2: ["ΦΠΑ συντελεστής 13%", 0.13],
            3: ["ΦΠΑ συντελεστής 6%", 0.06],
            4: ["ΦΠΑ συντελεστής 17%", 0.17],
            5: ["ΦΠΑ συντελεστής 9%", 0.09],
            6: ["ΦΠΑ συντελεστής 4%", 0.04],
            7: ["Άνευ Φ.Π.Α.", 0],
            8: ["Εγγραφές χωρίς ΦΠΑ", 0],
            9: ["ΦΠΑ συντελεστής 3%", 0.03]
        }
        return data

    def Measurements(self):
        data = {
            1: "Τεμάχια",
            2: "Κιλά",
            3: "Λίτρα",
            4: "Μέτρα",
            5: "Τετραγωνικά Μέτρα",
            6: "Κυβικά Μέτρα",
            7: "Τεμάχια_Λοιπές Περιπτώσεις"
        }
        return data

